// Реализация функции для нахождения всех уникальных элементов в массиве
// Создайте функцию uniqueElements, которая находит и возвращает массив всех уникальных элементов из переданного массива.
// Уникальные элементы — это те, которые встречаются в массиве только один раз.



console.log(uniqueElements([1, 2, 2, 3, 4, 4, 5])); // [1, 3, 5]
console.log(uniqueElements([7, 7, 8, 8, 9, 9]));    // []
console.log(uniqueElements(['a', 'b', 'b', 'c']));   // ['a', 'c']
console.log(uniqueElements([]));                     // []
